/**
  HLK-LD2410 library v 0.9.1
  Name: HLK_LD2410
  Purpose: Arduino library for the Hi-Link LD2410 24Ghz FMCW radar sensor

  @author Dejan Gjorgjevikj
  @version 0.9.1, 1/2024

  This sensor is a Frequency Modulated Continuous Wave radar, which makes it good for presence detection and its sensitivity at different ranges to both static and moving targets can be configured.
 
 ...todo...

Known limitations:
...

Resources:
  The code in this library was developed from scratch based on the manufacturer datasheet(s) https://drive.google.com/drive/folders/1p4dhbEJA3YubyIjIIC7wwVsSo8x29Fq-

This library is distributed in the hope that it will be useful, but
WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, MERCHANTABILITY or
FITNESS FOR A PARTICULAR PURPOSE either express or implied.
Released into the public domain.
Released under LGPL-2.1 see https://github.com/Gjorgjevikj/HLK_LD2410/blob/master/LICENSE for full license

https://github.com/Gjorgjevikj/HLK_LD2410.git
*/


#pragma once

#ifndef _HLK_LD2410_h
#define _HLK_LD2410_h
#include <Arduino.h>

#define HLK_LD_LIB_VERSION 0.9.1

#ifndef _LOG_LEVEL 
#define _LOG_LEVEL 2
#endif

//#define LOG_FATAL(...) Serial.printf(__VA_ARGS__)
#if _LOG_LEVEL > 0
#define R_LOG_ERROR(...) Serial.printf(__VA_ARGS__)
#else
#define R_LOG_ERROR(...) { }
#endif
#if _LOG_LEVEL >= 2
#define R_LOG_WARN(...) Serial.printf(__VA_ARGS__)
#else
#define R_LOG_WARN(...) { }
#endif
#if _LOG_LEVEL >= 4
#define R_LOG_INFO(...) Serial.printf(__VA_ARGS__)
#else
#define R_LOG_INFO(...) { }
#endif
#if _LOG_LEVEL >= 6
#define R_LOG_DEBUG(...) Serial.printf(__VA_ARGS__)
#else
#define R_LOG_DEBUG(...) { }
#endif
#if _LOG_LEVEL >= 7
#define DEBUG_DUMP_FRAME(...) _dumpFrame(__VA_ARGS__)
#else
#define DEBUG_DUMP_FRAME(...) { }
#endif
#if _LOG_LEVEL > 7
#define R_LOG_VERBOSE(...) Serial.printf(__VA_ARGS__)
#else
#define R_LOG_VERBOSE(...) { }
#endif

// This library is made for little endian systems only!
#define TEST_LITTLE_ENDIAN (((union { unsigned x; unsigned char c; }){1}).c)
#ifdef TEST_LITTLE_ENDIAN

#define RECEIVE_BUFFER_SIZE 80

class HLK_LD2410
{
public:
    enum FrameType : uint8_t 
    { 
        UNIDENTIFIED_FRAME = 0x00,
        ENGINEERING_DATA = 0x01,
        BASIC_DATA = 0x02,
        UNKNOWN_DATA_FORMAT = 0x0f,
        ACK_FRAME = 0xff,
        UNKNOWN_FRAME = 0xfe
    };
    enum RadarCommand : uint16_t 
    {
        ENABLE_CONFIG_MODE = 0x00FF,  // enable configuration mode
        DISABLE_CONFIG_MODE = 0x00FE,  // disable configuration mode
        SET_MAX_DIST_AND_DUR = 0x0060,  // set the maximum Distance Gate and Unmanned Duration Parameter
        READ_PARAMETER = 0x0061,  // read the parameters from the radar
        ENABLE_ENGINEERING_MODE = 0x0062,  // enable engineering mode of the radar
        DISABLE_ENGINEERING_MODE = 0x0063,  // disable engineering mode
        SET_GATE_SENS_CONFIG = 0x0064,  // set sensitivity 0-100% for moving and stationary gates
        READ_FIRMWARE_VERSION = 0x00A0,  // read  the firmware version
        SET_BAUDRATE = 0x00A1,  // set serial baud rate
        FACTORY_RESET = 0x00A2,  // Factory Reset
        RESTART = 0x00A3,  // Restart the radar
        SET_BLUETOOTH = 0x00A4, // Turn on/off bluetooth
        GET_MAC_ADDRESS = 0x00A5 // Read the MAC ADDRES
    };

    /// <summary>
    /// Communication speed to the radar sensor UART
    /// </summary>
    enum BaudRate : uint16_t
    {
        BAUD_9600   = 0X0001,
        BAUD_19200  = 0X0002,
        BAUD_38400  = 0X0003,
        BAUD_57600  = 0X0004,
        BAUD_115200 = 0X0005,
        BAUD_230400 = 0X0006,
        BAUD_256000 = 0X0007,  // radars default baud rate
        BAUD_460800 = 0X0008
    };
    enum GateType : uint32_t // for setSensitivity
    {
        GATE_0 = 0x00000000,
        GATE_1 = 0x00000001,
        GATE_2 = 0x00000002,
        GATE_3 = 0x00000003,
        GATE_4 = 0x00000004,
        GATE_5 = 0x00000005,
        GATE_6 = 0x00000006,
        GATE_7 = 0x00000007,
        GATE_8 = 0x00000008,
        GATE_ALL = 0x0000ffff
    };
    enum FrameField : uint32_t
    {
        CMD_FRAME_HEADER  = 0xFAFBFCFD,
        CMD_FRAME_TRAILER = 0x01020304,
        ACK_FRAME_HEADER = 0xFAFBFCFD,
        ACK_FRAME_TRAILER = 0x01020304,
        DAT_FRAME_HEADER = 0xF1F2F3F4,
        DAT_FRAME_TRAILER = 0xF5F6F7F8
    };
    enum FrameHeadByte : uint8_t
    {
        ACK_FRAME_HEAD_BYTE = 0xfd,
        DAT_FRAME_HEAD_BYTE = 0xf4
    };
    enum BluetoothMode : uint16_t
    {
        BluetoothOff = 0X000,
        BluetoothOn = 0X0001
    };
    enum FrameCL : bool
    {
        CURRENT_FRAME = false,
        LAST_FRAME = true
    };

#pragma pack (1)
    // frame header / trailer 
    union FrameMarkerType
    {
        uint32_t frameWord;
        uint8_t frameBytes[4];
    };
    // for identifying the frame type and getting the length
    struct FrameStart
    {
        FrameMarkerType header;
        uint16_t ifDataLength;
        uint8_t modeType; // if dataframe - 0x01 Enginnering data, 0x02 Target basic information
    };
    struct REQframeCommand
    {
        FrameMarkerType header; // FD FC FB FA 0xfafbfcfd
        uint16_t ifDataLength;
        uint16_t commandWord;
        FrameMarkerType trailer; // 04 03 02 01 0x01020304
    };
    struct REQframeCommandWithValue
    {
        FrameMarkerType header; // FD FC FB FA == 0xfafbfcfd
        uint16_t ifDataLength; // 04 00 == 0x0004
        uint16_t commandWord; // FF 00 == 0x00ff
        uint16_t commandValue; // 01 00 == 0x0001
        FrameMarkerType trailer; // 04 03 02 01 == 0x01020304
    };
    struct ACKframeCommand
    {
        FrameMarkerType header; // FD FC FB FA 0xfafbfcfd
        uint16_t ifDataLength; // 04 00 == 0x0004
        uint16_t commandReply;
        uint16_t ackStatus;
        FrameMarkerType trailer; // 04 03 02 01 0x01020304
    };
    struct ACKframeEnableConfig
    {
        FrameMarkerType header; // FD FC FB FA 0xfafbfcfd
        uint16_t ifDataLength; // 08 00 == 0x0008
        uint16_t commandReply; // FF 01 == 0x01ff
        uint16_t ackStatus; // 0 / 1
        uint16_t protocolVer; // 0x0001
        uint16_t bufferSize; // 0x0040
        FrameMarkerType trailer; // 04 03 02 01 0x01020304
    };

    /// <summary>
    /// struct representing the firmware version of the radar sensor (contains the firmware type, major, minor and bugfix parts of the version)
    /// </summary>
    struct FirmwareVersion
    {
        uint16_t type;    // firmware type
        uint8_t minor;    // minor version of the radar firmware
        uint8_t major;    // major version of the radar firmware
        uint32_t bugfix;  // bug fix version of the radar firmware
    };
    struct ACKframeFirmwareVersion
    {
        FrameMarkerType header; // FD FC FB FA 0xfafbfcfd
        uint16_t ifDataLength;
        uint16_t commandReply;
        uint16_t ackStatus;
        FirmwareVersion version;
        FrameMarkerType trailer; // 04 03 02 01 0x01020304
    };

    struct TargetData
    {
        uint16_t distance;
        uint8_t energy;
    };
    struct ReportingFrame // LD2410B uses little-endian format
    {
        FrameMarkerType header; // F4 F3 F2 F1 0xf1f2f3f4
        uint16_t ifDataLength;
        uint8_t modeType; // 0x01 Enginnering data, 0x02 Target basic information
        uint8_t ifHead; // 0xAA
        // intraframe begin - target data
        uint8_t targetState; // 0x00 No target, 0x01 Moving, 0x02 Stationary, 0x03 Moving+Stationary target
        TargetData movingTarget;
        TargetData stationaryTarget;
        uint16_t detectionDistance;
        // intraframe end
        uint8_t ifTail; // 0x55
        uint8_t ifCheck; // 0x00
        FrameMarkerType trailer; // F8 F7 F6 F5 0xf5f6f7f8
    };
    struct EngineeringFrame
    {
        FrameMarkerType header; // F4 F3 F2 F1 0xf1f2f3f4
        uint16_t ifDataLength;
        uint8_t modeType; // 0x01 Enginnering data, 0x02 Target basic information
        uint8_t ifHead; // 0xAA
        // target data
        uint8_t targetState; // 0x00 No target, 0x01 Moving, 0x02 Stationary, 0x03 Moving+Stationary target
        TargetData movingTarget;
        TargetData stationaryTarget;
        uint16_t detectionDistance;
        // engineering data
        uint8_t maxMovingDistanceGateN;
        uint8_t maxStaticDistanceGateN;
        uint8_t movementDistanceEnergy[9];
        uint8_t staticDistanceEnergy[9];
        uint16_t addInfo; // ??
        // intraframe end
        uint8_t ifTail; // 0x55
        uint8_t ifCheck; // 0x00
        FrameMarkerType trailer; // F8 F7 F6 F5 0xf5f6f7f8
    };

    /// <summary>
    /// struct representing the parameters of the radar sensor (#gates, motionSensitivity and StaticSensitivity per gate, noPersonDuration)
    /// </summary>
    struct RadarParameters
    {                                             // byte# in frame
        uint8_t maxDistanceGateN;                 //    12  = 08    == 0x08
        uint8_t maxMovingDistanceGateN;           //    13  = 08    == 0x08
        uint8_t maxStaticDistanceGateN;           //    14  = 08    == 0x08
        uint8_t motionSensitivityDistanceGate[9]; // 15-23  
        uint8_t restSensitivityDistanceGate[9];   // 24-33
        uint16_t noPersonDuration;                // 34-35
    };
    struct ACKframeParameter
    {                                             // byte#
        FrameMarkerType header;                   //  1- 4  = FD FC FB FA == 0xfafbfcfd
